ubirch/ubirch-kinetis-sdk/SDK_2.1_MK82FN256xxx15/boards/twrk80f150m/usb_examples/usb_device_ccid_smart_card_lite/bm/smart_card.c
            usbError = USB_DeviceSendRequest(
                g_UsbDeviceCcidSmartCard.deviceHandle, USB_DEVICE_CCID_SMART_CARD_ENDPOINT_BULK_IN,
                (uint8_t *)usbDeviceCcidSlotStatusResponse, USB_DEVICE_CCID_RESPONSE_HEADER_LENGTH);
            break;
        case USB_DEVICE_CCID_PC_TO_RDR_ESCAPE:
            break;
        case USB_DEVICE_CCID_PC_TO_RDR_ICCCLOCK:
            /* Get ICC clock status command */
            usbDeviceCcidSlotStatusResponse = (usb_device_ccid_slot_status_response_t *)&g_UsbDeviceCcidSmartCard
                                                  .slotsResponseBuffer[commonRequest->bSlot][0];
            usbDeviceCcidSlotStatusResponse->bMessageType = USB_DEVICE_CCID_RDR_TO_PC_SLOTSTATUS;
            usbDeviceCcidSlotStatusResponse->bSeq = commonRequest->bSeq;
            usbDeviceCcidSlotStatusResponse->bSlot = commonRequest->bSlot;
            usbDeviceCcidSlotStatusResponse->bClockStatus = g_UsbDeviceCcidSmartCard.clockStatus;
            usbDeviceCcidSlotStatusResponse->bError = 0U;
            usbDeviceCcidSlotStatusResponse->bStatus = (USB_DEVICE_CCID_SLOT_STATUS_COMMAND_STATUS_PROCESSED_NO_ERROR) |
                                                       (USB_DEVICE_CCID_SLOT_STATUS_ICC_PRESENT_ACTIVE);
            usbDeviceCcidSlotStatusResponse->dwLength = 0U;
            usbError = USB_DeviceSendRequest(
                g_UsbDeviceCcidSmartCard.deviceHandle, USB_DEVICE_CCID_SMART_CARD_ENDPOINT_BULK_IN,
                (uint8_t *)usbDeviceCcidSlotStatusResponse, USB_DEVICE_CCID_RESPONSE_HEADER_LENGTH);
            break;
        case USB_DEVICE_CCID_PC_TO_RDR_T0APDU:
            break;
        case USB_DEVICE_CCID_PC_TO_RDR_SECURE:
            break;
        case USB_DEVICE_CCID_PC_TO_RDR_MECHANICAL:
            break;
        case USB_DEVICE_CCID_PC_TO_RDR_ABORT:
            break;
        case USB_DEVICE_CCID_PC_TO_RDR_SETDATARATEANDCLOCKFREQUENCY:
            break;
        default:
            break;
    }

    if (kStatus_USB_InvalidRequest == usbError)
    {
        usbDeviceCcidSlotStatusResponse = (usb_device_ccid_slot_status_response_t *)&g_UsbDeviceCcidSmartCard
                                              .slotsResponseBuffer[commonRequest->bSlot][0];
        usbDeviceCcidSlotStatusResponse->bMessageType = USB_DEVICE_CCID_RDR_TO_PC_SLOTSTATUS;
        usbDeviceCcidSlotStatusResponse->bSeq = commonRequest->bSeq;
        usbDeviceCcidSlotStatusResponse->bSlot = commonRequest->bSlot;
        usbDeviceCcidSlotStatusResponse->bClockStatus = g_UsbDeviceCcidSmartCard.clockStatus;
        usbDeviceCcidSlotStatusResponse->bError = USB_DEVICE_CCID_SLOT_ERROR_COMMAND_NOT_SUPPORTED;
        usbDeviceCcidSlotStatusResponse->bStatus =
            (USB_DEVICE_CCID_SLOT_STATUS_COMMAND_STATUS_FAILED) | (USB_DEVICE_CCID_SLOT_STATUS_ICC_PRESENT_ACTIVE);
        usbDeviceCcidSlotStatusResponse->dwLength = 0U;
        usbError =
            USB_DeviceSendRequest(g_UsbDeviceCcidSmartCard.deviceHandle, USB_DEVICE_CCID_SMART_CARD_ENDPOINT_BULK_IN,
                                  (uint8_t *)usbDeviceCcidSlotStatusResponse, USB_DEVICE_CCID_RESPONSE_HEADER_LENGTH);
    }

    USB_DeviceRecvRequest(g_UsbDeviceCcidSmartCard.deviceHandle, USB_DEVICE_CCID_SMART_CARD_ENDPOINT_BULK_OUT,
                          g_UsbDeviceCcidSmartCard.slotsCommandBuffer[USB_DEVICE_CCID_SMART_CARD_MAX_SLOTS],
                          USB_DEVICE_CCID_COMMAND_BUFFER_LENGTH);
    return usbError;
}

/* Device callback */
usb_status_t USB_DeviceCallback(usb_device_handle handle, uint32_t event, void *param)
{
    usb_status_t error = kStatus_USB_Success;
    uint8_t *temp8 = (uint8_t *)param;

    switch (event)
    {
        case kUSB_DeviceEventBusReset:
        {
            /* USB device bus reset signal detected */
            g_UsbDeviceCcidSmartCard.attach = 0U;
            g_UsbDeviceCcidSmartCard.remoteWakeup = 0U;
            g_UsbDeviceCcidSmartCard.suspend = 0U;
            USB_DeviceControlPipeInit(g_UsbDeviceCcidSmartCard.deviceHandle);
#if defined(USB_DEVICE_CONFIG_EHCI) && (USB_DEVICE_CONFIG_EHCI > 0U)
            if (kStatus_USB_Success == USB_DeviceGetStatus(g_UsbDeviceCcidSmartCard.deviceHandle,
                                                           kUSB_DeviceStatusSpeed, &g_UsbDeviceCcidSmartCard.speed))
            {
                USB_DeviceSetSpeed(g_UsbDeviceCcidSmartCard.speed);
            }
#endif

            error = kStatus_USB_Success;
        }
        break;

        case kUSB_DeviceEventSuspend:
        {
            /* USB device bus suspend signal detected */
            if (g_UsbDeviceCcidSmartCard.attach)
            {
                g_UsbDeviceCcidSmartCard.suspend = 1U;
                usb_echo("USB ccid device suspend\r\n");
                error = kStatus_USB_Success;
            }
        }
        break;
        case kUSB_DeviceEventResume:
        {
            /* USB device bus resume signal detected */
            if (g_UsbDeviceCcidSmartCard.attach)
            {
                g_UsbDeviceCcidSmartCard.suspend = 0U;
                usb_echo("USB ccid device resume\r\n");
                error = kStatus_USB_Success;
            }
        }
        break;
        case kUSB_DeviceEventSetConfiguration:
            if (USB_DEVICE_CCID_SMART_CARD_CONFIGURE_INDEX == (*temp8))
            {
                /* Set the configuration */
                usb_device_endpoint_init_struct_t epInitStruct;
                usb_device_endpoint_callback_struct_t endpointCallback;
                uint8_t usbCurrentSr;

                endpointCallback.callbackFn = USB_DeviceCcidInterruptIn;
                endpointCallback.callbackParam = handle;

                epInitStruct.zlt = 0U;
                epInitStruct.transferType = USB_ENDPOINT_INTERRUPT;
                epInitStruct.endpointAddress = USB_DEVICE_CCID_SMART_CARD_ENDPOINT_INTERRUPT_IN |
                                               (USB_IN << USB_DESCRIPTOR_ENDPOINT_ADDRESS_DIRECTION_SHIFT);
                if (USB_SPEED_HIGH == g_UsbDeviceCcidSmartCard.speed)
                {
                    epInitStruct.maxPacketSize = HS_INTERRUPT_IN_PACKET_SIZE;
                }
                else
                {
                    epInitStruct.maxPacketSize = FS_INTERRUPT_IN_PACKET_SIZE;
                }

                USB_DeviceInitEndpoint(g_UsbDeviceCcidSmartCard.deviceHandle, &epInitStruct, &endpointCallback);

                endpointCallback.callbackFn = USB_DeviceCcidBulkIn;
                endpointCallback.callbackParam = handle;

                epInitStruct.zlt = 1U;
                epInitStruct.transferType = USB_ENDPOINT_BULK;
                epInitStruct.endpointAddress = USB_DEVICE_CCID_SMART_CARD_ENDPOINT_BULK_IN |
                                               (USB_IN << USB_DESCRIPTOR_ENDPOINT_ADDRESS_DIRECTION_SHIFT);
                if (USB_SPEED_HIGH == g_UsbDeviceCcidSmartCard.speed)
                {
                    epInitStruct.maxPacketSize = HS_BULK_IN_PACKET_SIZE;
                }
                else
                {
                    epInitStruct.maxPacketSize = FS_BULK_IN_PACKET_SIZE;
                }

                USB_DeviceInitEndpoint(g_UsbDeviceCcidSmartCard.deviceHandle, &epInitStruct, &endpointCallback);

                endpointCallback.callbackFn = USB_DeviceCcidBulkOut;
                endpointCallback.callbackParam = handle;

                epInitStruct.zlt = 0U;
                epInitStruct.transferType = USB_ENDPOINT_BULK;
                epInitStruct.endpointAddress = USB_DEVICE_CCID_SMART_CARD_ENDPOINT_BULK_OUT |
                                               (USB_OUT << USB_DESCRIPTOR_ENDPOINT_ADDRESS_DIRECTION_SHIFT);
                if (USB_SPEED_HIGH == g_UsbDeviceCcidSmartCard.speed)
                {
                    epInitStruct.maxPacketSize = HS_BULK_OUT_PACKET_SIZE;
                }
                else
                {
                    epInitStruct.maxPacketSize = FS_BULK_OUT_PACKET_SIZE;
                }

                USB_DeviceInitEndpoint(g_UsbDeviceCcidSmartCard.deviceHandle, &epInitStruct, &endpointCallback);

                USB_DeviceRecvRequest(g_UsbDeviceCcidSmartCard.deviceHandle,
                                      USB_DEVICE_CCID_SMART_CARD_ENDPOINT_BULK_OUT,
                                      g_UsbDeviceCcidSmartCard.slotsCommandBuffer[USB_DEVICE_CCID_SMART_CARD_MAX_SLOTS],
                                      USB_DEVICE_CCID_COMMAND_BUFFER_LENGTH);
                usbCurrentSr = __get_PRIMASK();
                __ASM("CPSID I");
                g_UsbDeviceCcidSmartCard.attach = 1U;
                /* If the slot status changed and the slot is present, send the slot changed status to the host */
                if (g_UsbDeviceCcidSmartCard.slotsChanged)
                {
                    if ((g_UsbDeviceCcidSmartCard.suspend) && (g_UsbDeviceCcidSmartCard.remoteWakeup))
                    {
                        USB_DeviceSetStatus(g_UsbDeviceCcidSmartCard.deviceHandle, kUSB_DeviceStatusBus, NULL);
                    }
                    usb_device_ccid_notify_slot_chnage_notification_t *ccidNotify =
                        (usb_device_ccid_notify_slot_chnage_notification_t *)&g_UsbDeviceCcidSmartCard
                            .slotsChangeBuffer[0];
                    ccidNotify->bMessageType = USB_DEVICE_CCID_RDR_TO_PC_NOTIFYSLOTCHANGE;
                    ccidNotify->bmSlotICCState[0] = 0x03U;
                    USB_DeviceSendRequest(
                        g_UsbDeviceCcidSmartCard.deviceHandle, USB_DEVICE_CCID_SMART_CARD_ENDPOINT_INTERRUPT_IN,
                        g_UsbDeviceCcidSmartCard.slotsChangeBuffer, sizeof(g_UsbDeviceCcidSmartCard.slotsChangeBuffer));
                }
                __set_PRIMASK(usbCurrentSr);
            }
            break;
        default:
            break;
    }

    return error;
}

